//
//  Struct.swift
//  huge_test
//
//  Created by User10 on 2020/10/11.
//

import Foundation

struct characters{
    var Ch_name : String
    var Intro : String
}
let role = [
    characters(Ch_name:"阿信",Intro:"""
                (主唱) 1975年12月6日 (1975-12-06)（37歲），出生於台北市北投區。
                畢業自師大附中美術班，與怪獸擔任過該校吉他社上下學期的社長跟副社長。\n
                實踐大學室內設計系(現已改為建築系)。\n
                是五月天的創始團員之一。\n
                除了樂團的活動之外，也經常幫其他歌手寫歌、擔任音樂製作。\n
                除了詞曲創作外，也從事寫作，並在發行了《Happy·Birth·Day──阿信·搖滾詩的誕生與轉生》與《浪漫的逃亡》之後晉身為暢銷作家。\n和不二良創辦了設計品牌STAY REAL。
                """),
    characters(Ch_name:"怪獸",Intro:"""
                (吉他手) 1976年11月28日 (1976-11-28)（36歲）出生於新竹市。
                畢業自國立師大附中，與阿信擔任過上下學期的吉他社社長跟副社長。
                國立臺灣大學社會學系。
                五月天的團長。
                擔任丁噹演唱會總監，也常與其他歌手有音樂上的合作和製作。
                """),
    characters(Ch_name:"石頭",Intro:"""
                (吉他手) 1975年12月11日 (1975-12-11)（37歲）出生於台北市。
                原名「石航瑋」（用於《第一張創作專輯　瘋狂世界》中），後改名石錦航。
                同樣畢業自師大附中。
                淡江大學水環系。
                曾在「你要去哪裡」演唱會上公開向女友(人稱狗狗)求婚，目前兩人已經結婚。（歌曲：〈天天想你〉，片段收錄在《你要去哪裡演唱會Live全紀錄》中。）
                2007年，誕下一位可愛的男娃兒，人稱「小石頭」。2009年再獲一子。
                2008年，發行了個人第一本書──《我的搖滾媽咪》，記錄一家三口幸福的生活。
                """),
    characters(Ch_name:"瑪莎",Intro:"""
                (貝斯手) 1977年4月25日 (1977-04-25)（35歲）於高雄市出生。
                除了貝斯（低音吉他）之外，瑪莎擅長的樂器還包括吉他、鋼琴、大提琴和口琴。
                同樣畢業自師大附中。
                天主教輔仁大學社會學系。
                為陶晶瑩創辦的女性網站姐妹淘專欄作家。
                """),
    characters(Ch_name:"冠佑",Intro:"""
                (鼓手) 1973年7月28日 (1973-07-28)（39歲）出生於苗栗市。
                原名「劉諺明」，（直到第五張專輯《神的孩子都在跳舞》）之後正式改名為劉冠佑。
                為五月天樂團第四任鼓手，於1999年加入五月天，是五月天中年紀最大的團員，也是最晚加入樂團的成員。
                畢業自國光藝校，擅長鼓和電子琴。
                曾在「當我們混在一起 Final Home」北京站演唱會上公開向女友王行芝求婚，目前兩人已經結婚。（歌曲：〈相信〉，片段收錄於《2004-2006 Final Home「讓我們永遠混在一起」世界巡迴演唱會全記錄》。）
                2006年誕下女兒，人稱「小玫瑰」。2009 年再添一女，人稱「小薔薇」。
                和妻子王行芝創辦了潮牌Drumming
                """),
]
let fans=[
    characters(Ch_name:"彼得潘",Intro:"""
                MayDay的Bigfan
                """),
]
